# Relational Database Coursework

**Author:** Gaoyuan Liang - H00353899

**Username:** jessica

Students have been supplied this skeleton notebook for completing their F21DF coursework.

This notebook makes use of the [IPython SQL magic](https://github.com/catherinedevlin/ipython-sql) developed by [Catherine Devlin's](http://catherinedevlin.blogspot.com/). Magics are a mechanism within Jupyter to achieve some specific feature within Python such as executing SQL commands over a database. An overview of magics can be found in the [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/01.03-magic-commands.html).

Students are required to complete all sections of this notebook and then submit it according to the supplied instructions.

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Connect-to-the-MACS-Database-Server" data-toc-modified-id="Connect-to-the-MACS-Database-Server-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Connect to the MACS Database Server</a></span></li><li><span><a href="#Database-Design-[10-Marks]" data-toc-modified-id="Database-Design-[10-Marks]-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Database Design [10 Marks]</a></span></li><li><span><a href="#Relational-Schema-[10-Marks]" data-toc-modified-id="Relational-Schema-[10-Marks]-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Relational Schema [10 Marks]</a></span></li><li><span><a href="#Loading-Data-[5-Marks]" data-toc-modified-id="Loading-Data-[5-Marks]-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Loading Data [5 Marks]</a></span></li><li><span><a href="#Querying-the-Database-[20-Marks]" data-toc-modified-id="Querying-the-Database-[20-Marks]-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Querying the Database [20 Marks]</a></span></li></ul></div>

## Connect to the MACS Database Server

If the following commands do not work, then refer to the lab notebooks used in the course.

In [1]:
# Load the SQL magics for jupyter
%load_ext sql

The following cell set the address for the MySQL database server to connect to. The default addess is for MySQL to be installed on the same machine, i.e. `localhost:3306`, as is the case on the MACS Linux VM. The MACS MySQL server address is `mysql-server-1.macs.hw.ac.uk:3306`.

In [2]:
# Set mysql server address
server = "localhost:3306"

In [3]:
# Establish connection to MACS Database Server
from getpass import getpass
username = 'jessica' #input('Enter your mysql username: ')
password = 'GDerit4758' #getpass(prompt='Enter your mysql password: ')
connection_string = "mysql+pymysql://{username}:{password}@{server}/{username}".format(username=username, password=password, server=server)
%sql $connection_string

## 1. Database Design [10 Marks]

## 3. Schema Implementation [10 Marks]

**ToDo:** For each table in your relational schema, give the SQL CREATE statement for the table in one cell and the insert statements in a separate cell. Use markdown cells to describe the table and give any design decisions.

drop all the tables if exist

In [20]:
%%sql
DROP TABLE IF EXISTS Customers;
CREATE TABLE Customers (
cid INT NOT NULL,
name varchar(255),
PRIMARY KEY (cid)
);
INSERT INTO Customers VALUES (1, 'Anne');
INSERT INTO Customers VALUES (2, 'Bob');
INSERT INTO Customers VALUES (3, 'Carol');
select * from Customers;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[(1, 'Anne'), (2, 'Bob'), (3, 'Carol')]

create table of Customer and insert some data

In [21]:
%%sql
DROP TABLE IF EXISTS Boats;
CREATE TABLE Boats (
bid INT NOT NULL,
bname varchar(255),
colour varchar(255),
PRIMARY KEY (bid)
);
INSERT INTO Boats VALUES (9001, 'Edinburgh', 'red');
INSERT INTO Boats VALUES (9002, 'Dubai', 'blue');
select * from Boats;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.

[(9001, 'Edinburgh', 'red'), (9002, 'Dubai', 'blue')]

create the table of Garment_Order

In [29]:
%%sql
DROP TABLE IF EXISTS Reserves;
CREATE TABLE Reserves (
cid INT NOT NULL,
bid INT NOT NULL,
day date
);
INSERT INTO Reserves VALUES (1, 9002, '2020-12-01');
INSERT INTO Reserves VALUES (3, 9002, '2020-12-11');
INSERT INTO Reserves VALUES (1, 9001, '2020-12-03');
INSERT INTO Reserves VALUES (2, 9001, '2020-12-03');
INSERT INTO Reserves VALUES (3, 9001, '2020-12-03');
INSERT INTO Reserves VALUES (1, 9001, '2020-12-03');
INSERT INTO Reserves VALUES (2, 9001, '2020-12-03');
select * from Reserves;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
7 rows affected.

[(1, 9002, datetime.date(2020, 12, 1)),
 (3, 9002, datetime.date(2020, 12, 11)),
 (1, 9001, datetime.date(2020, 12, 3)),
 (2, 9001, datetime.date(2020, 12, 3)),
 (3, 9001, datetime.date(2020, 12, 3)),
 (1, 9001, datetime.date(2020, 12, 3)),
 (2, 9001, datetime.date(2020, 12, 3))]

create table of Garment, color, and has_color, and insert some data
for the question of available in 5 or more colours.

In [30]:
%%sql
select Customers.name
from Reserves, Customers, Boats
where Reserves.cid = Customers.cid
and Reserves.bid = Boats.bid
and Boats.colour = "blue";

 * mysql+pymysql://jessica:***@localhost:3306/jessica
2 rows affected.

[('Anne',), ('Carol',)]

In [31]:
%%sql
select bid, day, count(*) as reservation_number
from Reserves
group by bid, day;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
3 rows affected.

[(9001, datetime.date(2020, 12, 3), 5),
 (9002, datetime.date(2020, 12, 1), 1),
 (9002, datetime.date(2020, 12, 11), 1)]

In [59]:
%%sql
select bname as boat_name, 
concat(substr(day, 9,2), '-', 
	substr(day, 6,2), '-', 
	substr(day, 1,4)) as date_EUROPEAN_style,
reservation_number as boat_hired_time_number
from (
	select Reserves.bid, cast(day as varchar(100)) as day, 
	Boats.bname, count(*) as reservation_number
	from Reserves, Boats
	where Boats.bid = Reserves.bid
	group by bid, day
) a 
where reservation_number > 4;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[('Edinburgh', '03-12-2020', 5)]

build the table of item and insert some data 
for question of order numbers of orders that do not contain trousers.

In [10]:
%%sql

CREATE TABLE item (
order_number INT NOT NULL,
Garment_ID INT NOT NULL,
price_paid DOUBLE,
FOREIGN KEY (order_number) REFERENCES Garment_Order(order_number),
FOREIGN KEY (Garment_ID) REFERENCES Garment(Garment_ID)
);

INSERT INTO item (order_number, Garment_ID)
VALUES (4563, 1);
INSERT INTO item (order_number, Garment_ID)
VALUES (4563, 3);

INSERT INTO item (order_number, Garment_ID)
VALUES (5876, 2);

select * from item;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[(4563, 1, None), (4563, 3, None), (5876, 2, None)]

## 4. Querying the Database [20 Marks]
Populate each of the cells below with the required SQL query.

### a. Provide the name and email of all customers who have an unfulfilled order.

In [11]:
%%sql

SELECT DISTINCT Customer.full_name, Customer.customer_email
FROM Garment_Order 
LEFT JOIN Customer ON Customer.customer_email = Garment_Order.customer_email
WHERE fulfilled_date IS NULL

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[('Jgsnk Igrn', 'gsdg@sjdgkdns.com')]

### b. Give the names of garments that are available in 5 or more colours.

In [12]:
%%sql

SELECT Garment.name, COUNT(has_color.colour_ID) AS available_colours
FROM has_color
LEFT JOIN Garment ON Garment.Garment_ID = has_color.Garment_ID
GROUP BY has_color.Garment_ID

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[('Jessica shirt', 5)]

### c. Provide the order numbers of orders that do not contain trousers.

In [13]:
%%sql

select count(distinct item.order_number) as order_numbers_not_contain_trousers
from item 
left join Garment on Garment.Garment_ID = item.Garment_ID
where Garment_type != 'trouser'

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[(1,)]

### d. What was the total income from orders received on 1 September 2020?

In [14]:
%%sql

select sum(total_price_paid) as total_income
from Garment_Order where received_date = '2020-09-01'

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[(997.0,)]

### e. Of the fulfilled orders, what is the name of the customer(s) who had to wait the longest?

In [15]:
%%sql

select 
Customer.full_name, 
fulfilled_date - received_date as wait_days 
from Garment_Order
left join Customer on Customer.customer_email = Garment_Order.customer_email
order by fulfilled_date - received_date desc
limit 1;

 * mysql+pymysql://jessica:***@localhost:3306/jessica
1 rows affected.

[('Jgsnk Igrn', 19)]